{

  "COSC 109": {
    "shortTitle": "Technical Aspects of OS",
    "title": "Technical aspects of operating systems",
    "classdesc": "This course will provide students with an overview of the UNIX and Windows operating systems. Topics include setup, processes, file systems, log files, recovery, popular daemons/services, text manipulation utilities, network utilities, shells, and scripting. Brief overviews of network troubleshooting and batch files are included.",
    "skills": [
      [],
      [],
      [ "Linux", "Shell Scripting" ]
    ]
  },
  "COSC 111": {
    "shortTitle": "Computer Programming I",
    "title": "Computer Programming I",
    "classdesc": "This course is an introduction to the design, implementation, and understanding of computer programs. Topics include problem solving, modeling, algorithm design, and abstraction, with the emphasis on the development of working programs.",
    "skills": [
      [ "Java" ],
      [],
      []
    ]
  },
  "COSC 118": {
    "shortTitle": "Computer Networks",
    "title": "Computer Networks",
    "classdesc": "This course introduces the theory of practice of modern telecommunications with an emphasis on the TCP/IP (Transmission Control Protocol/Internet Protocol) stack. Students will learn to install and troubleshoot the electronic components necessary for telephony and data communications.",
    "skills": [
      [],
      [ "Wireshark" ],
      [ "Networking" ]
    ]
  },
  "ECON 115": {
    "shortTitle": "Micro-economics",
    "title": "Principles of micro-economics",

    "classdesc": "This course is the \"micro\" half of the standard university-level introductory course in economic institutions and theory. It deals with supply and demand, the analysis of the firm under different market structures, markets for factors of production, and the distribution of income.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "ECON 125": {
    "shortTitle": "Macro-economics",
    "title": "Principles of macro-economics",
    "classdesc": "This course is the \"macro\" half of the standard university-level introduction to economic institutions and theory. It deals with national income theory, money and banking, fiscal and monetary policies and international trade, with an emphasis on the Canadian economy and its problems. ",
    "skills": [
      [],
      [],
      []
    ]
  },
  "BUAD 111": {
    "shortTitle": "Accounting 1",
    "title": "Financial accounting 1",
    "classdesc": "This course is an introduction to the system in which information is collected by the accounting process and presented by financial statements. Accounting cycle, statement preparation, special journals, internal control and the accounting for cash, inventory, payroll, merchandising and sales tax are examined. Basic financial reporting will be reviewed.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "CMNS 113": {
    "shortTitle": "Technical comm for IT",
    "title": "Technical communications for information technology",
    "classdesc": "This course develops technical writing and speaking skills. Students will apply elements of style, awareness of audience, and clarity of purpose to summaries, memos, letters, employment applications, instructions, and technical manuals. They will learn to plan, draft, and edit efficiently, and will develop the confidence and skills required for speaking in job-related situations.",
    "skills": [
      [],
      [],
      [ "Technical Writing" ]
    ]
  },
  "ECON 261": {
    "shortTitle": "Econ of developing countries",
    "title": "Economics of developing countries",
    "classdesc": "This course introduces students to economic conditions in less developed countries. The first part of the course provides students with information on what constitutes underdevelopment and looks at various theories that attempt to explain why some countries are less developed than others. Internal and external economic policies useful in changing the economic performance of these countries are explored.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "CMNS 123": {
    "shortTitle": "Analysis for IT",
    "title": "Analysis and reporting for information technology",
    "classdesc": "In this course students further develop their individual writing and speaking skills and apply research techniques and documentation standards to produce case analyses, proposals, progress and technical reports, and oral presentations. Students will also work in groups to develop collaborative writing and project management skills.",
    "skills": [
      [],
      [],
      [ "Technical Writing" ]
    ]
  },
  "COSC 121": {
    "shortTitle": "Computer programming II",
    "title": "Computer programming II",
    "classdesc": "This course is an advanced programming course in the application of software engineering techniques to the design and implementation of programs manipulating complex data structures.",
    "skills": [
      [ "Java" ],
      [],
      [ "Data Structures", "Algorithms" ]
    ]
  },
  "COSC 126": {
    "shortTitle": "Systems analysis and design",
    "title": "Systems analysis and design",
    "classdesc": "This course concentrates on the activities associated with developing computer-based information systems. Online systems, including all aspects dealing with the use of databases and data communications, will be emphasized. Practical work will expose students to relational database management systems within a client-server environment and may include Computer Assisted Software Engineering (CASE) tools.",
    "skills": [
      [],
      [ "Microsoft Access" ],
      [ "UML" ]
    ]
  },
  "COSC 131": {
    "shortTitle": "Visual programming",
    "title": "Visual programming",
    "classdesc": "This course is an introduction to visual programming using the Visual Programming Integrated Development Environement (IDE) platform. Students will learn how to develop and deploy Windows-based software programs. Topics include event-driven programming concepts, graphical user interface (GUI) design, Windows programming, database programming and web application development.",
    "skills": [
      [],
      [],
      [ "UX" ]
    ]
  },
  "MATH 139": {
    "shortTitle": "Math for IT",
    "title": "Mathematics for Information Technology",
    "classdesc": "This course includes a review of algebra including linear equations, logarithms, exponentials and complex numbers, basic logic, Boolean algebra, number type conversations from base 10 to binary, octal and hex, an introduction to recursion, an introduction to set theory and an introduction to graph theory. ",
    "skills": [
      [],
      [],
      [ "Discrete Mathematics" ]
    ]
  },
  "COSC 221": {
    "shortTitle": "Discrete structures",
    "title": "Intro to discrete structures",
    "classdesc": "This course is an introduction to sets, logic, combinatorics, and graph theory, as applied in computing: sets and propositions, permutations and combinations, graphs and trees, Boolean algebra, algorithms, and applications.",
    "skills": [
      [],
      [],
      [ "Data Structures", "Discrete Mathematics" ]
    ]
  },
  "COSC 213": {
    "shortTitle": "LAMP",
    "title": "Web development with LAMP",
    "classdesc": "This course focuses on web development using LAMP technology, the Linux operating system, the Apache web server, the MySQL database, and the PHP server-side scripting language. Course topics include LAMP set-up, HTML-5, CSS, PHP, MySQL, fine-tuning and administration of the web server.",
    "skills": [
      [ "PHP", "HTML" ],
      [ "LAMP", "MySQL" ],
      [ "Linux", "Sys-admin" ]
    ]
  },
  "COSC 219": {
    "shortTitle": "Client-side web systems",
    "title": "Client-side web systems",
    "classdesc": "This course is an introduction to web applications published to the Internet. Topics will include validating end-user input, asynchronous and synchronous programming techniques, and content management systems. A scripting language for web development is the primary focus, with an exploration of one higher order library.",
    "skills": [
      [ "Javascript", "CSS", "HTML" ],
      [],
      []
    ]
  },
  "COSC 222": {
    "shortTitle": "Data structures",
    "title": "Computer data structures",
    "classdesc": "This course is an exploration of abstract data types (ADTs), their implementations, algorithms (including sorting and searching) and algorithm analysis. ADTs explored include vectors, queues, stacks, deques, lists, sequences, iterators, binary trees, search trees, priority queues, dictionaries, sets, graphs.",
    "skills": [
      [ "C" ],
      [],
      [ "Data Structures", "Discrete Mathematics" ]
    ]
  },
  "COSC 236": {
    "shortTitle": "Object oriented design",
    "title": "Object oriented systems analysis and design",
    "classdesc": "This course is an introduction to object-oriented techniques in systems analysis and design. It introduces a number of tools and techniques used in object-oriented systems analysis and design (OOA&D) and builds on the OOA&D techniques from previous courses. Topics will include development lifecycles (in particular the iterative development model), analysis techniques (requirements and uses cases), design techniques (modeling methods, responsibilities and collaborations), and design patterns.",
    "skills": [
      [],
      [],
      [ "UML" ]
    ]
  },
  "COSC 304": {
    "shortTitle": "Database management",
    "title": "Intro to database management systems",
    "classdesc": "This course is an introduction to the use and operating principles of database management systems. Topics include: semantic modelling, query languages, relational calculus and algebra as applied to database design, implementation and access. Students will receive hands-on experience in accessing information using a query language.",
    "skills": [
      [],
      [ "MySQL" ],
      [ "Relational Databases" ]
    ]
  },
  "COSC 205": {
    "shortTitle": "Project management",
    "title": "Project management",
    "classdesc": "This course focuses on the business cycle as it relates to software development including: planning, organizing, directing, monitoring and control. Particular emphasis is given to scheduling practices and solving problems when the project is behind schedule. Students will be enrolled in a computer science capstone project course concurrently and will practice implementing a variety of problem solving strategies.",
    "skills": [
      [],
      [ "Git" ],
      []
    ]
  },
  "COSC 224": {
    "shortTitle": "CS Project",
    "title": "Projects in computer science",
    "classdesc": "This capstone course for diploma students, synthesizes the material learned in the previous three semesters, including programming, systems analysis and design, networking, and database design and development, or are learning in a corequisite course, to complete a project. Students will choose a project from a selection provided by the professor. In This course I developed my i-search kelowna project.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "COSC 315": {
    "shortTitle": "Operating systems",
    "title": "Intro to operating systems",
    "classdesc": "This course is an introduction to batch, multiprogramming and time-sharing systems. Process synchronization and communication. Main memory allocation techniques including virtual memory. Process scheduling. Deadlock avoidance and prevention. File organization and device management.",
    "skills": [
      [ "C++" ],
      [],
      [ "Shell Scripting", "Algorithms" ]
    ]
  },
  "COSC 331": {
    "shortTitle": "Middleware",
    "title": "Middleware Development",
    "classdesc": "In this course, students will explore the technologies employed in the development and deployment of software which participates in a multi-tier enterprise application environment. Topics include application servers, and the presentation, service, data and information system tiers.",
    "skills": [
      [],
      [ "Docker" ],
      []
    ]
  },
  "COSC 341": {
    "shortTitle": "User experience",
    "title": "User experience",
    "classdesc": "As computers become ever more prevalent, the way in which we interact with them becomes more crucial. This course will examine different types of interaction, both from a psychological perspective and a prototyping perspective. Specifically, we will look at the design through the process of sketching user experiences, with a view to getting the right design and getting the design right.",
    "skills": [
      [],
      [],
      [ "UX" ]
    ]
  },
  "COSC 404": {
    "shortTitle": "Database management II",
    "title": "Advanced database management systems",
    "classdesc": "This course is a continuation and expansion of the concepts from COSC 304. Review of database environment and database design principles are included. Advanced topics include recovery and concurrency control in distributed database systems, object and object relational databases, data mining, and data warehousing. Students will design and develop database applications using state-of-the art technology. ",
    "skills": [
      [ "PLSQL" ],
      [ "MySQL" ],
      []
    ]
  },
  "COSC 470": {
    "shortTitle": "Software engineering",
    "title": "Software engineering",
    "classdesc": "This course explores the design and implementation of large, multi-module-program systems. Topics include the software life cycle, design tools, features and use of module-oriented programming languages, intermodule communication, and eXtreme programming. Students will require significant out-of-class time to complete this course successfully. This course is to be taken in the final year of the BCIS degree.",
    "skills": [
      [],
      [ "Git" ],
      []
    ]
  },
  "COSC 211": {
    "shortTitle": "Machine architecture",
    "title": "Machine architecture",
    "classdesc": "This course is an introduction to the conceptual structure and functional characteristics of a computer. Topics include computer organization, memory addressing schemes, and decoding and executing instructions. Laboratory assignments use the assembly language of selected machines.",
    "skills": [
      [],
      [],
      [ "Algorithms" ]
    ]
  },
  "COSC 232": {
    "shortTitle": "System security",
    "title": "Information system security",
    "classdesc": "In this course, students will explore various aspects of computing where security is important. Techniques for enforcing security will be investigated.",
    "skills": [
      [],
      [],
      [ "Secure Design", "Encryption" ]
    ]
  },
  "COSC 419": {
    "shortTitle": "Full Stack Web-Dev",
    "title": "Topics: Full Stack Web Development",
    "classdesc": "This course covered a diverse set of topics under the full-stack banner. Students work with a diverse set of frameworks covering many aspects of web development and server administration. Students put it together by designing a live online chatroom.",
    "skills": [
      [ "Laravel", "Flask" ],
      [ "Docker" ],
      [ "Secure Design" ]
    ]
  },
  "PHIL 350": {
    "shortTitle": "Business ethics",
    "title": "Business ethics",
    "classdesc": "This course examines moral and ethical principles as they apply to business. The case method will be used extensively. This course is integrated with the other Business Capstone courses by a small-business-across-the-curriculum theme.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "BUAD 123": {
    "shortTitle": "Management principles",
    "title": "Management principles",
    "classdesc": "A study of the universal functions of management: planning, organizing, leading and controlling. This course emphasizes strategic business planning and decision making; organizing resources and work scheduling; leading and motivating individuals and groups to achieve objectives; and controlling worker output and productivity so that goals are achieved effectively and efficiently. ",
    "skills": [
      [],
      [],
      []
    ]
  },
  "COSC 360": {
    "shortTitle": "Server platform as a service",
    "title": "Server platform as a service",
    "classdesc": "Students will focus on single-server deployment on a variety of cloud-native platforms(PaaS – Platform as a Service). Students will explore the need to move from their own server to a cloud platform when they have hope to serve thousands of end-users. Topics may include: performant server-side scripting, cost effectiveness and efficiency, load balancing, robustness testing.",
    "skills": [
      [],
      [ "AWS" ],
      [ "Sys-admin", "Cloud Usage" ]
    ]
  },
  "COSC 416": {
    "shortTitle": "Non-relational Databases",
    "title": "Topics: Non-relational Databases",
    "classdesc": "In this course students will cover the principles of non-relational databases with software such as MongoDB or Redis. Later students will use python to develop their own simplistic database software.",
    "skills": [
      ["Python"],
      [ "MongoDB", "Redis"],
      []
    ]
  },
  "COSC 416b": {
    "shortTitle": "Survey of Databases",
    "title": "Topics: Survey of Databases",
    "classdesc": "In this course students examined a wide array of database softwares and services. Lab assignments saw students testing this programs and running performance comparisons on cloud-service versions of them with python scripts.",
    "skills": [
      ["Python"],
      [ "DynamoDB", "MongoDB", "MySQL", "AWS", "Azure"],
      [ "Cloud Usage" ]
    ]
  },
  "ECON 335": {
    "shortTitle": "Econ - social issues",
    "title": "The economics of social issues",
    "classdesc": "Designed for students with little or no prior background in economics, this course surveys the applications of economic concepts and methodologies in the analyses of contemporary social issues such as poverty, global warming, crime, discrimination, taxation and free trade.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "COSC 417": {
    "shortTitle": "Internet of Things",
    "title": "Topics: Internet Routing",
    "classdesc": "In this course students used python to examine and explore global networks. Topics such as DNS, TCP/IP, and ASNs + Zones of authority.",
    "skills": [
      ["Python"],
      ["Wireshark"],
      ["Networking"]
    ]
  },
  "PHIL 331": {
    "shortTitle": "Computing ethics",
    "title": "Computing ethics",
    "classdesc": "This course examines ethical and professional issues facing those who work with computers. Issues include piracy, hacking, responsibility and liability for the use of software, cyberpornography and freedom of information, computerised invasion of privacy, computers in the workplace, the use of artificial intelligence and expert systems.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "CMNS 100": {
    "shortTitle": "Communications",
    "title": "Intro to communications",
    "classdesc": "This course provides students with an introduction to communications theory. Surveying historical and contemporary theories, the course will offer a critical examination of the ways people communicate with each other via print and/or new media, orally, interpersonally, and visually. Students will analyse meaning-making in a range of mediated contexts, including advertising, television, film, popular culture, and the Internet.",
    "skills": [
      [],
      [],
      []
    ]
  },
  "COSC 331b": {
    "shortTitle": "Microservices",
    "title": "Microservices and software",
    "classdesc": "Students will be introduced to web services that interact across multiple servers and the need for optimal performance and security. The evolution of enterprise software from legacy enterprise applications to the use of microservice containers and orchestration tools will be explored. Topics will include: distributed computing, integrating existing enterprise applications with microservices, and using patterns of software architecture for design.",
    "skills": [
      [],
      [ "AWS", "Azure" ],
      [ "Sys-admin", "Encryption" ]
    ]
  },
  "PSYC 111": {
    "shortTitle": "Psychology 1",
    "title": "Intro to psychology: basic processes",
    "classdesc": "This course is a survey of topics in psychology which relate to basic processes. The topics covered will include: the nervous system and physiological processes, sensation and perception, learning, cognition, and memory. Introductory methods and statistics will also be studied.",
    "skills": [
      [],
      [],
      []
    ]
  }
}
